src/InformationRegisters/рнсОбщиеНастройки/рнсОбщиеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рнсОбщиеНастройки</name>
  <resources>
    <name>Настройки</name>
    <comment>Настройки</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Значение1</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Значение2</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Значение3</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Значение4</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Значение5</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Отключено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Раздел</name>
    <type>
      <types>CatalogRef.рнсРазделыОбщихНастроек</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Секция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ключ</name>
    <type>
      <types>CatalogRef.рнсКлючиОбщихНастроек</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/рнсРазделыОбщихНастроек/рнсРазделыОбщихНастроек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рнсРазделыОбщихНастроек</name>
  <predefined>
    <items>
      <name>ЗаполнениеЗаявкиДС</name>
      <description>Заполнение заявки ДС</description>
    </items>
    <items>
      <name>ЗначенияПоУмолчанию</name>
      <description>Значения по умолчанию</description>
    </items>
    <items>
      <name>ОповещниеОбИзмненеиях</name>
      <description>Оповещние об измненеиях</description>
    </items>
  </predefined>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.рнсГруппыДоступаРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСекцииРаздела</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКлюча</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьКлючНастройки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения1</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения2</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения3</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения4</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения5</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФормыЗаполненияХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Секции</name>
    <attributes>
      <name>Секция</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвязиПараметровВыбора</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКДанным</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзменениеЗначения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкаКлюча</name>
    <attributes>
      <name>ПолеКлюча</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
      </type>
    </attributes>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/рнсОбщиеНастройки/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы   

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗапрещенныеПоля = Новый Массив; 
	ЗапрещенныеПоля.Добавить("Ключ");  
	ЗапрещенныеПоля.Добавить("Значение1");
	ЗапрещенныеПоля.Добавить("Значение2");
	ЗапрещенныеПоля.Добавить("Значение3");
	ЗапрещенныеПоля.Добавить("Значение4");
	ЗапрещенныеПоля.Добавить("Значение5");  	
	
	Список.УстановитьОграниченияИспользованияВОтборе(ЗапрещенныеПоля); 
	Список.УстановитьОграниченияИспользованияВГруппировке(ЗапрещенныеПоля);
	Список.УстановитьОграниченияИспользованияВПорядке(ЗапрещенныеПоля);	
	
КонецПроцедуры 

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РазделОтборПриИзменении(Элемент)
	
	ПараметрыРаздела 	= Неопределено;
	Секция 				= Неопределено;
	ПолеВводаСекция 	= Элементы.СекцияОтбор;
	ПолеВводаСекция.СписокВыбора.Очистить();
	ПолеВводаСекция.Видимость = Ложь;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Секция", Неопределено,,, Ложь);
	
	Если ЗначениеЗаполнено(Раздел) Тогда   	
		
		ПараметрыРаздела = ПолучиьПараметрыРаздела(Раздел);
		Если ПараметрыРаздела.ИспользоватьСекцииРаздела Тогда
			ПолеВводаСекция.СписокВыбора.ЗагрузитьЗначения(ПараметрыРаздела.Секции);  
			ПолеВводаСекция.Видимость = Истина;	
		КонецЕсли;  
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Раздел", Раздел,,, Истина); 		
		
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Раздел", Неопределено,,, Ложь);   	
	КонецЕсли;  
	
	УстановитьВидимостьКолонок(ПараметрыРаздела);
	
КонецПроцедуры

&НаКлиенте
Процедура СекцияОтборПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Секция) Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Секция", Секция,,, Истина);		
	Иначе    	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Секция", Неопределено,,, Ложь);
	КонецЕсли;		
	
КонецПроцедуры  

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура СоздатьНастройкуРаздела(Команда)
	
	ПараметрыОткрытия = Новый Структура("Раздел, Секция", Раздел, Секция);
	
	ОткрытьФорму("РегистрСведений.рнсОбщиеНастройки.Форма.ФормаЗаписи", ПараметрыОткрытия, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	УстановитьЗначениеФлажка(Истина);	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)   	
	УстановитьЗначениеФлажка(Ложь);	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции   

&НаКлиенте
Процедура УстановитьЗначениеФлажка(Флаг)
	
	УстановитьФлагОтключитьНаСервере(Флаг);
	Элементы.Список.Обновить();
	
КонецПроцедуры    

&НаСервереБезКонтекста
Функция ПолучиьПараметрыРаздела(Раздел) 
	          
	Результат = Новый Структура("ИспользоватьСекцииРаздела, ИспользоватьКлючНастройки, Секции,
									| Заголовок1, Заголовок2, Заголовок3, Заголовок4, Заголовок5");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	рнсРазделыОбщихНастроек.ИспользоватьСекцииРаздела КАК ИспользоватьСекцииРаздела,
		|	рнсРазделыОбщихНастроек.ИспользоватьКлючНастройки КАК ИспользоватьКлючНастройки,
		|	ЕСТЬNULL(рнсРазделыОбщихНастроек.ТипЗначения1.Заголовок, НЕОПРЕДЕЛЕНО) КАК Заголовок1,
		|	ЕСТЬNULL(рнсРазделыОбщихНастроек.ТипЗначения2.Заголовок, НЕОПРЕДЕЛЕНО) КАК Заголовок2,
		|	ЕСТЬNULL(рнсРазделыОбщихНастроек.ТипЗначения3.Заголовок, НЕОПРЕДЕЛЕНО) КАК Заголовок3,
		|	ЕСТЬNULL(рнсРазделыОбщихНастроек.ТипЗначения4.Заголовок, НЕОПРЕДЕЛЕНО) КАК Заголовок4,
		|	ЕСТЬNULL(рнсРазделыОбщихНастроек.ТипЗначения5.Заголовок, НЕОПРЕДЕЛЕНО) КАК Заголовок5
		|ИЗ
		|	Справочник.рнсРазделыОбщихНастроек КАК рнсРазделыОбщихНастроек
		|ГДЕ
		|	рнсРазделыОбщихНастроек.Ссылка = &Раздел
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Таблица.Секция КАК Секция
		|ИЗ
		|	Справочник.рнсРазделыОбщихНастроек.Секции КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка = &Раздел";
	
	Запрос.УстановитьПараметр("Раздел", Раздел);
	
	РезультатЗапроса 		= Запрос.ВыполнитьПакет();  
	ВыборкаШапка 			= РезультатЗапроса[0].Выбрать();
	Секции					= РезультатЗапроса[1].Выгрузить().ВыгрузитьКолонку("Секция");
	
	Пока ВыборкаШапка.Следующий() Цикл 	
		ЗаполнитьЗначенияСвойств(Результат, ВыборкаШапка);	
		Результат.Секции = Секции;  	
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции    

&НаСервере
Процедура УстановитьФлагОтключитьНаСервере(Флаг)

	Для каждого Ит Из Элементы.Список.ВыделенныеСтроки Цикл
		
		Запись = РегистрыСведений.рнсОбщиеНастройки.СоздатьМенеджерЗаписи();  
		ЗаполнитьЗначенияСвойств(Запись, Ит);
		Запись.Прочитать();
		
		Если Запись.Выбран() Тогда  
			Запись.Отключено = Флаг;
			Запись.Записать();	
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьВидимостьКолонок(ПараметрыРаздела)
	
	Если ПараметрыРаздела = Неопределено Тогда 	
		
		Элементы.Секция.Видимость 	= Истина; 
		Элементы.Ключ.Видимость 	= Ложь;
		
		Элементы.Значение1.Видимость = Истина; 
		Элементы.Значение2.Видимость = Истина;
		Элементы.Значение3.Видимость = Истина;
		Элементы.Значение4.Видимость = Истина;
		Элементы.Значение5.Видимость = Истина;
		
		Элементы.Значение1.Заголовок = НСтр("ru = 'Значение 1'"); 
		Элементы.Значение2.Заголовок = НСтр("ru = 'Значение 2'");
		Элементы.Значение3.Заголовок = НСтр("ru = 'Значение 3'");
		Элементы.Значение4.Заголовок = НСтр("ru = 'Значение 4'");
		Элементы.Значение5.Заголовок = НСтр("ru = 'Значение 5'");	
		
	Иначе  		
		
		Элементы.Секция.Видимость 	= ПараметрыРаздела.ИспользоватьСекцииРаздела; 
		Элементы.Ключ.Видимость 	= ПараметрыРаздела.ИспользоватьКлючНастройки; 			
		
		Элементы.Значение1.Видимость = ПараметрыРаздела.Заголовок1 <> Неопределено; 
		Элементы.Значение2.Видимость = ПараметрыРаздела.Заголовок2 <> Неопределено;
		Элементы.Значение3.Видимость = ПараметрыРаздела.Заголовок3 <> Неопределено;
		Элементы.Значение4.Видимость = ПараметрыРаздела.Заголовок4 <> Неопределено;
		Элементы.Значение5.Видимость = ПараметрыРаздела.Заголовок5 <> Неопределено;
		
		Элементы.Значение1.Заголовок = ?(ЗначениеЗаполнено(ПараметрыРаздела.Заголовок1), ПараметрыРаздела.Заголовок1, НСтр("ru = 'Значение 1'")); 
		Элементы.Значение2.Заголовок = ?(ЗначениеЗаполнено(ПараметрыРаздела.Заголовок2), ПараметрыРаздела.Заголовок2, НСтр("ru = 'Значение 2'"));
		Элементы.Значение3.Заголовок = ?(ЗначениеЗаполнено(ПараметрыРаздела.Заголовок3), ПараметрыРаздела.Заголовок3, НСтр("ru = 'Значение 3'"));
		Элементы.Значение4.Заголовок = ?(ЗначениеЗаполнено(ПараметрыРаздела.Заголовок4), ПараметрыРаздела.Заголовок4, НСтр("ru = 'Значение 4'"));
		Элементы.Значение5.Заголовок = ?(ЗначениеЗаполнено(ПараметрыРаздела.Заголовок5), ПараметрыРаздела.Заголовок5, НСтр("ru = 'Значение 5'"));  	
		
	КонецЕсли;	
	
КонецПроцедуры  

#КонецОбласти
